{"@context": "https://schema.org", "@type": "NewsArticle", "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.moneycontrol.com/news/business/markets/nifty-bulls-unlikely-to-rest-after-breakout-bet-on-these-3-stocks-for-good-returns-10875891.html", "name": "Nifty bulls unlikely to rest after breakout. Bet on these 3 stocks for good returns"}, "isPartOf": {"@type": "CreativeWork", "name": "Moneycontrol", "url": "https://www.moneycontrol.com/"}, "inLanguage": "en", "headline": "Nifty bulls unlikely to rest after breakout. Bet on these 3 stocks for good returns", "description": "Given the benchmark index's breakout, it is advisable to consider initiating small new positions in individual stocks. It is recommended to accumulate further at lower levels if the Nifty retraces back to 18,880 levels.", "keywords": "HCL Technologies,Kirloskar Electric Company,Reliance Industries,BSE Sensex,Nifty50,NSE Nifty", "articleSection": "Business", "url": "https://www.moneycontrol.com/news/business/markets/nifty-bulls-unlikely-to-rest-after-breakout-bet-on-these-3-stocks-for-good-returns-10875891.html", "image": ["https://images.moneycontrol.com/static-mcnews/2023/06/stocks5-8.jpg?impolicy=website&width=1600&height=900"], "datePublished": "2023-06-29T14:15:48+05:30", "dateModified": "2023-06-30T07:33:13+05:30", "articleBody": "Over the past few weeks, the Nifty50 index has repeatedly tested the resistance range of 18,880-18,887 levels and remained confined to a narrow consolidation range. However, there has been a recent upward gap and a breakout above the previous high, signaling that the upward momentum is here to sustain.  Additionally, a bullish crossover has occurred as the 100-day MA (moving average) has crossed the 200-day MA, reaffirming&nbsp;the&nbsp;bullish trend.  Given the benchmark index's breakout, it is advisable to consider initiating small new positions in individual stocks. It is recommended to accumulate further at lower levels if the Nifty retraces back to 18,880 levels.  Here are three buy calls for short term:  Reliance Industries: Buy | LTP: Rs 2,529.5 | Stop-Loss: Rs 2,460 | Target: Rs 2,619 | Return: 3.5 percent  After forming a bottom near Rs 2,180 levels in March this year, the stock price of Reliance Industries has been forming higher tops and higher bottoms.  While the stock price was inching higher, it crossed above multiple moving averages of 50-day, 100-day and 200-day MA (moving average). This up move halted near Rs 2,584 levels in this month and experienced a corrective decline. This decline took support near 50-day as well as 200-day MA and now is showing signs of reversal.  Recently there has been a golden crossover where the 50-day MA has crossed above the 200-day MA which adds bullishness to the stock. Thus, one can go long in this stock with a potential up move close to Rs 2,619 (3.5 percent). Any price move below Rs 2,460 can be considered to move out of the stock.    Kirloskar Electric: Buy | LTP: Rs 122.65 | Stop-Loss: Rs 113.90 | Target: Rs&nbsp;129.6 | Return: 5.6 percent  The stock price of Kirloskar Electric had made a breakout from a Symmetrical Triangle pattern. A breakout from this defined pattern indicates a continuation of the ongoing trend.  Currently, it is re-testing the breakout level which makes it attractive to buy at current levels with a favourable risk-reward ratio. Since the price has been comfortably moving above the multiple moving averages, the underlying trend remains bullish.  Parabolic SAR continues to remain in buy mode. On-Balance Volume continues to remain near 52-week high. The relative strength (RS) has been trending higher, confirming the outperformance compared to Nifty500.  Thus, the formation of higher tops-higher bottoms and breakout from the technical pattern brings in buying opportunities in the stock with a potential gain of Rs 129.60 (8 percent) and maintain a stop-loss at Rs 113.90.    HCL Technologies: Buy | LTP: Rs 1,170.25 | Stop-Loss: Rs 1,149 | Target: Rs 1,230 | Return: 5 percent  Last week the stock price of HCL Technologies made a breakout from a long consolidation pattern which triggers a new buying opportunity. After forming a top near Rs 1,150 levels, the stock witnessed a corrective decline which halted near the 200-day MA and witnessed a rebound.  The rebound in price tested the previous highs and retraced. This led to the development of the consolidation. The stock tested the 200-day MA multiple times before picking up some upside momentum.  Recently, following the price breakout, 50-day MA crossed above the 100-day MA, adding further bullishness to the stock. Currently, the stock price is consolidating near the breakout level making it attractive to buy with a favourable risk- reward ratio.  Thus, going long on this stock is advisable with a stop-loss of Rs 1,149 and can look for a target of nearly Rs 1,230.    Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.  Disclaimer: MoneyControl is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.", "author": {"@type": "Person", "url": "https://www.moneycontrol.com/author/foram-chheda-30321/", "name": "Foram Chheda"}, "publisher": {"@type": "NewsMediaOrganization", "name": "Moneycontrol", "url": "https://www.moneycontrol.com", "logo": {"@type": "ImageObject", "url": "https://images.moneycontrol.com/mcnews/images/eng-left-mc-logo-600x60.png", "width": "600", "height": "60"}}, "associatedMedia": {"@type": "imageObject", "url": "https://images.moneycontrol.com/static-mcnews/2023/06/stocks5-8.jpg?impolicy=website&width=1600&height=900", "caption": "Nifty bulls unlikely to rest after breakout. Bet on these 3 stocks for good returns", "height": "900", "width": "1600"}, "tags": "HCL Technologies,Kirloskar Electric Company,Reliance Industries,Sensex,Stocks Views,Technicals"}